school/cs/Internal Assessment/test.org
#+TITLE: Test
#+AUTHOR: <Your Name Here
#+BIBLIOGRAPHY: bibliography.bib
#+latex_header: \usepackage{apacite}
#+latex_header: \bibliography{bibliography}
#+latex_header: \bibliographystyle{apalike}

* Abstract

You cannot use an org-mode header here.
If you do, it trashes the table of contents for the apa6 document class.
That's why Abstract is bolded manually.

As you can see, I write my documents 1 sentence to a line.
This is because I keep these documents under version control.
A single English sentence is similar to a single line of code.
You wouldn't run lines of code together in a production codebase, so don't run sentences together in a VC'ed text document.

Latex and org-mode both interpret a single empty line as a paragraph break, so the fact that your source document is 1 sentence per line will not be visible to anybody other than you.

cite:devlin2019
#+latex: \printbibliography
